#pragma once

#include "CBaseEntity.h"
#include "CBaseCombatWeapon.h"
#include "../../Utils/NetVars.h"
#include "../../Utils/Utils.h"
#include <array>
#include "UtlVector.h"

#pragma region DEFINES

#define	FL_ONGROUND				(1 << 0)
#define FL_DUCKING				(1 << 1)
#define	FL_WATERJUMP			(1 << 3)
#define FL_ONTRAIN				(1 << 4)
#define FL_INRAIN				(1 << 5)
#define FL_FROZEN				(1 << 6)
#define FL_ATCONTROLS			(1 << 7)
#define	FL_CLIENT				(1 << 8)
#define FL_FAKECLIENT			(1 << 9)
#define	FL_INWATER				(1 << 10)
#define FL_HIDEHUD_SCOPE		(1 << 11)

enum EMoveType
{
    MOVETYPE_NONE = 0,	// never moves
    MOVETYPE_ISOMETRIC,			// For players -- in TF2 commander view, etc.
    MOVETYPE_WALK,				// Player only - moving on the ground
    MOVETYPE_STEP,				// gravity, special edge handling -- monsters use this
    MOVETYPE_FLY,				// No gravity, but still collides with stuff
    MOVETYPE_FLYGRAVITY,		// flies through the air + is affected by gravity
    MOVETYPE_VPHYSICS,			// uses VPHYSICS for simulation
    MOVETYPE_PUSH,				// no clip to world, push and crush
    MOVETYPE_NOCLIP,			// No gravity, no collisions, still do velocity/avelocity
    MOVETYPE_LADDER,			// Used by players only when going onto a ladder
    MOVETYPE_OBSERVER,			// Observer movement, depends on player's observer mode
    MOVETYPE_CUSTOM,			// Allows the entity to describe its own physics

    // should always be defined as the last item in the list
    MOVETYPE_LAST = MOVETYPE_CUSTOM,


    ACT_ITEM2_VM_LOWERED_TO_IDLE,
    ACT_RELOAD_SUCCEED,
    ACT_RELOAD_FAIL,
    ACT_WALK_AIM_AUTOGUN,
    ACT_RUN_AIM_AUTOGUN,
    ACT_IDLE_AUTOGUN,
    ACT_IDLE_AIM_AUTOGUN,
    ACT_RELOAD_AUTOGUN,
    ACT_CROUCH_IDLE_AUTOGUN,
    ACT_RANGE_ATTACK_AUTOGUN,
    ACT_JUMP_AUTOGUN,
    ACT_IDLE_AIM_PISTOL,
    ACT_WALK_AIM_DUAL,
    ACT_RUN_AIM_DUAL,
    ACT_IDLE_DUAL,
    ACT_IDLE_AIM_DUAL,
    ACT_RELOAD_DUAL,
    ACT_CROUCH_IDLE_DUAL,
    ACT_RANGE_ATTACK_DUAL,
    ACT_JUMP_DUAL,
    ACT_IDLE_SHOTGUN,
    ACT_IDLE_AIM_SHOTGUN,
    ACT_CROUCH_IDLE_SHOTGUN,
    ACT_JUMP_SHOTGUN,
    ACT_IDLE_AIM_RIFLE,
    ACT_RELOAD_RIFLE,
    ACT_CROUCH_IDLE_RIFLE,
    ACT_RANGE_ATTACK_RIFLE,
    ACT_JUMP_RIFLE,
    ACT_SLEEP,
    ACT_WAKE,
    ACT_FLICK_LEFT,
    ACT_FLICK_LEFT_MIDDLE,
    ACT_FLICK_RIGHT_MIDDLE,
    ACT_FLICK_RIGHT,
    ACT_SPINAROUND,
    ACT_PREP_TO_FIRE,
    ACT_FIRE,
    ACT_FIRE_RECOVER,
    ACT_SPRAY,
    ACT_PREP_EXPLODE,
    ACT_EXPLODE,
    ACT_DOTA_IDLE,
    ACT_DOTA_RUN,
    ACT_DOTA_ATTACK,
    ACT_DOTA_ATTACK_EVENT,
    ACT_DOTA_DIE,
    ACT_DOTA_FLINCH,
    ACT_DOTA_DISABLED,
    ACT_DOTA_CAST_ABILITY_1,
    ACT_DOTA_CAST_ABILITY_2,
    ACT_DOTA_CAST_ABILITY_3,
    ACT_DOTA_CAST_ABILITY_4,
    ACT_DOTA_OVERRIDE_ABILITY_1,
    ACT_DOTA_OVERRIDE_ABILITY_2,
    ACT_DOTA_OVERRIDE_ABILITY_3,
    ACT_DOTA_OVERRIDE_ABILITY_4,
    ACT_DOTA_CHANNEL_ABILITY_1,
    ACT_DOTA_CHANNEL_ABILITY_2,
    ACT_DOTA_CHANNEL_ABILITY_3,
    ACT_DOTA_CHANNEL_ABILITY_4,
    ACT_DOTA_CHANNEL_END_ABILITY_1,
    ACT_DOTA_CHANNEL_END_ABILITY_2,
    ACT_DOTA_CHANNEL_END_ABILITY_3,
    ACT_DOTA_CHANNEL_END_ABILITY_4,
    ACT_MP_RUN_SPEEDPAINT,
    ACT_MP_LONG_FALL,
    ACT_MP_TRACTORBEAM_FLOAT,
    ACT_MP_DEATH_CRUSH,
    ACT_MP_RUN_SPEEDPAINT_PRIMARY,
    ACT_MP_DROWNING_PRIMARY,
    ACT_MP_LONG_FALL_PRIMARY,
    ACT_MP_TRACTORBEAM_FLOAT_PRIMARY,
    ACT_MP_DEATH_CRUSH_PRIMARY,
    ACT_DIE_STAND,
    ACT_DIE_STAND_HEADSHOT,
    ACT_DIE_CROUCH,
    ACT_DIE_CROUCH_HEADSHOT,
    ACT_CSGO_NULL,
    ACT_CSGO_DEFUSE,
    ACT_CSGO_DEFUSE_WITH_KIT,
    ACT_CSGO_FLASHBANG_REACTION,
    ACT_CSGO_FIRE_PRIMARY,
    ACT_CSGO_FIRE_PRIMARY_OPT_1,
    ACT_CSGO_FIRE_PRIMARY_OPT_2,
    ACT_CSGO_FIRE_SECONDARY,
    ACT_CSGO_FIRE_SECONDARY_OPT_1,
    ACT_CSGO_FIRE_SECONDARY_OPT_2,
    ACT_CSGO_RELOAD,
    ACT_CSGO_RELOAD_START,
    ACT_CSGO_RELOAD_LOOP,
    ACT_CSGO_RELOAD_END,
    ACT_CSGO_OPERATE,
    ACT_CSGO_DEPLOY,
    ACT_CSGO_CATCH,
    ACT_CSGO_SILENCER_DETACH,
    ACT_CSGO_SILENCER_ATTACH,
    ACT_CSGO_TWITCH,
    ACT_CSGO_TWITCH_BUYZONE,
    ACT_CSGO_PLANT_BOMB,
    ACT_CSGO_IDLE_TURN_BALANCEADJUST,
    ACT_CSGO_IDLE_ADJUST_STOPPEDMOVING,
    ACT_CSGO_ALIVE_LOOP,
    ACT_CSGO_FLINCH,
    ACT_CSGO_FLINCH_HEAD,
    ACT_CSGO_FLINCH_MOLOTOV,
    ACT_CSGO_JUMP,
    ACT_CSGO_FALL,
    ACT_CSGO_CLIMB_LADDER,
    ACT_CSGO_LAND_LIGHT,
    ACT_CSGO_LAND_HEAVY,
    ACT_CSGO_EXIT_LADDER_TOP,
    ACT_CSGO_EXIT_LADDER_BOTTOM,
};

#pragma endregion

class CBasePlayer;
class CBaseCombatWeapon;

struct  CCSGOPlayerAnimationState
{
    char	pad0[0x60]; // 0x00
    CBasePlayer* pEntity; // 0x60
    CBaseCombatWeapon* pActiveWeapon; // 0x64
    CBaseCombatWeapon* pLastActiveWeapon; // 0x68
    float		flLastUpdateTime; // 0x6C
    int			iLastUpdateFrame; // 0x70
    float		flLastUpdateIncrement; // 0x74
    float		flEyeYaw; // 0x78
    float		flEyePitch; // 0x7C
    float		flGoalFeetYaw; // 0x80
    float		flLastFeetYaw; // 0x84
    float		flMoveYaw; // 0x88
    float		flLastMoveYaw; // 0x8C // changes when moving/jumping/hitting ground
    float		flLeanAmount; // 0x90
    char	pad1[0x4]; // 0x94
    float		flFeetCycle; // 0x98 0 to 1
    float       flFeetWeight;
    float		flMoveWeight; // 0x9C 0 to 1
    float		flMoveWeightSmoothed; // 0xA0
    float		flDuckAmount; // 0xA4
    float		flHitGroundCycle; // 0xA8
    float		flRecrouchWeight; // 0xAC
    Vector		vecOrigin; // 0xB0
    Vector		vecLastOrigin;// 0xBC
    Vector		vecVelocity; // 0xC8
    Vector		vecVelocityNormalized; // 0xD4
    Vector		vecVelocityNormalizedNonZero; // 0xE0
    float		flVelocityLenght2D; // 0xEC
    float		flJumpFallVelocity; // 0xF0
    float		flSpeedNormalized; // 0xF4 // clamped velocity from 0 to 1 
    float		flRunningSpeed; // 0xF8
    float		flDuckingSpeed; // 0xFC
    float		flDurationMoving; // 0x100
    float		flDurationStill; // 0x104
    bool		bOnGround; // 0x108
    bool		bHitGroundAnimation; // 0x109
    char	pad2[0x2]; // 0x10A
    float		flNextLowerBodyYawUpdateTime; // 0x10C
    float		flDurationInAir; // 0x110
    float		flLeftGroundHeight; // 0x114
    float		flHitGroundWeight; // 0x118 // from 0 to 1, is 1 when standing
    float		flWalkToRunTransition; // 0x11C // from 0 to 1, doesnt change when walking or crouching, only running
    char	pad3[0x4]; // 0x120
    float		flAffectedFraction; // 0x124 // affected while jumping and running, or when just jumping, 0 to 1
    char	pad4[0x208]; // 0x128
    float		flMinBodyYaw; // 0x330
    float		flMaxBodyYaw; // 0x334
    float		flMinPitch; //0x338
    float		flMaxPitch; // 0x33C
    int			iAnimsetVersion; // 0x340

    float& YawDesyncAdjustement()
    {
        return *(float*)((uintptr_t)this + 0x334);
    }

    void SetTickInterval() {
        if (iLastUpdateFrame > GlobalVars->framecount - 1)
            iLastUpdateFrame = GlobalVars->framecount - 1;

        if (flLastUpdateTime >= GlobalVars->curtime)
            flLastUpdateTime = GlobalVars->curtime - GlobalVars->interval_per_tick;
    }
};

struct AnimationLayer
{
public:
    bool m_bClientBlend;		 //0x0000
    float m_flBlendIn;			 //0x0004
    void* m_pStudioHdr;			 //0x0008
    int m_nDispatchSequence;     //0x000C
    int m_nDispatchSequence_2;   //0x0010
    uint32_t m_nOrder;           //0x0014
    uint32_t m_nSequence;        //0x0018
    float m_flPrevCycle;       //0x001C
    float m_flWeight;          //0x0020
    float m_flWeightDeltaRate; //0x0024
    float m_flPlaybackRate;    //0x0028
    float m_flCycle;           //0x002C
    void* m_pOwner;              //0x0030
    char pad_0038[4];            //0x0034
};

class CUserCmd;
class C_BaseAnimating;


class CBoneAccessor
{
public:
    C_BaseAnimating* m_pAnimating;

    matrix3x4_t* m_pBones;

    int m_ReadableBones;		// Which bones can be read.
    int m_WritableBones;		// Which bones can be written.
};

class CBaseViewModel {
public:
    NETVAR(m_nSequence, int, "DT_BaseViewModel", "m_nSequence")
    NETVAR(m_nAnimationParity, int, "DT_BaseViewModel", "m_nAnimationParity")
};

#define MAX_WEAPONS 64
#define MAX_VIEWMODELS 2

class CBasePlayer : public CBaseEntity {
public:
    static CBasePlayer* GetPlayerByIndex(int index)
    {
        return static_cast <CBasePlayer*> (EntityList->GetClientEntity(index));
    }
public:
    NETVAR(m_iHealth, int, "DT_BasePlayer", "m_iHealth")
    NETVAR(m_fFlags, int, "DT_CSPlayer", "m_fFlags")
    NETVAR(m_vecViewOffset, Vector, "DT_BasePlayer", "m_vecViewOffset[0]")
    NETVAR(m_iTeamNum, int, "DT_BaseEntity", "m_iTeamNum")
